УТ/src/Catalogs/CRM_ТипыОтношений/CRM_ТипыОтношений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОтношений</name>
  <predefined>
    <items>
      <name>Другое</name>
      <description>Другое</description>
    </items>
    <items>
      <name>Конкурент</name>
      <description>Конкурент</description>
    </items>
    <items>
      <name>Покупатель</name>
      <description>Покупатель</description>
    </items>
    <items>
      <name>Поставщик</name>
      <description>Поставщик</description>
    </items>
  </predefined>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ТипыОтношений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НастроитьДоступностьРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДоступностьРеквизитов()
	
	Если Объект.Ссылка = Справочники.CRM_ТипыОтношений.Покупатель Тогда
		Элементы.Клиент.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Поставщик Тогда
		Элементы.Поставщик.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Конкурент Тогда
		Элементы.Конкурент.Доступность = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.CRM_ТипыОтношений.Другое Тогда
		Элементы.ПрочиеОтношения.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
